C({"name": "sessions", "type": "attribute", "parent": "cweb/node_modules/sesh/lib/session.js", "comment": "<p>session.js - sessions module for node.js</p>\n\n<p>Core Sesssion Logic : \n    inimino@inimino.org \n    2009-12-01\n    MIT License</p>\n\n<p>Additional API modiftications\n    Marak Squires - MIT License</p>\n\n<p>## Options ##</p>\n\n<p>The |options| argument is optional, and if present may have any of the following properties:</p>\n\n<ul>\n<li><p>domain</p>\n\n<p>If present, the cookie (and hence the session) will apply to the given domain, including any subdomains.\n For example, on a request from foo.example.org, if the domain is set to '.example.org', then this session will persist across any subdomain of example.org.\n By default, the domain is not set, and the session will only be visible to other requests that exactly match the domain.</p></li>\n<li><p>path</p>\n\n<p>If set, the session will be restricted to URLs underneath the given path.\n By default the path is \"/\", which means that the same sessions will be shared across the entire domain.</p>\n\n<p>For more details on path and domain, see http://en.wikipedia.org/wiki/HTTP_cookie or RFC 2109.</p></li>\n<li><p>sessionID</p>\n\n<p>If you want to specify your own session ID, you can do that here.\n Session IDs will be stored in a cookie and used to identify this particular session on subsequent requests.\n They should be unique, and if the session contains sensitive data, they should be hard to guess (cf session hijacking).\n By default, a random string is generated using 64 bits of entropy from Math.random().</p></li>\n<li><p>lifetime</p>\n\n<p>If you wish to create a persistent session (one that will last after the user closes the window and visits the site again) you must specify a lifetime as a number of seconds.\n Common values are 86400 for one day, and 604800 for one week.\n The lifetime controls both when the browser's cookie will expire, and when the session object will be freed by the sessions module.\n By default, the browser cookie will expire when the window is closed, and the session object will be freed 24 hours after the last request is seen.</p>\n\n<h2>Session Objects</h2>\n\n<p>sessions.lookupOrCreate returns a session object.</p>\n\n<p>Session objects have the following properties:</p></li>\n<li><p>path</p></li>\n<li>domain</li>\n<li><p>lifetime</p>\n\n<p>These correspond to the options of the same name, and can be changed after the session is created if desired.</p></li>\n<li><p>data</p>\n\n<p>The data property of a session object is the object, initially empty, on which you can store any session data.</p></li>\n<li><p>getSetCookieHeaderValue()</p>\n\n<p>This method returns the value to send in the Set-Cookie header which you should send with every request that goes back to the browser, e.g.\n response.setHeader('Set-Cookie', session.getSetCookieHeaderValue());</p></li>\n</ul>", "children": []})